In [121]:
import numpy as np
import pandas as pd

In [122]:
#creating series
list1 = [1,2,3,4,5]

index_list = ['a', 'b', 'c', 'd', 'e']

pd.Series(data=list1, index=index_list)

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [123]:
#creating series
list1 = [1,2,3,4,5]

index_list = ['a', 'b', 'c', 'd', 'e']

pd.Series(data=list1, index=index_list)
#creating series using array

arr1 = np.arange(5) 

#creating series using dictionary 

dict1 = {'a':10, 'b':20, 'c':30, 'd':40, 'e':'hello'}


dict2 = {'a':10, 'b':20, 'c':30, 'd':40, 'e':'hello', 'f':60}


series1 = pd.Series(data=list1, index=index_list)
series2 = pd.Series(data=arr1, index=index_list)
series3 = pd.Series(dict1)
series4 = pd.Series(dict2)

In [124]:
series1

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [125]:
series2

a    0
b    1
c    2
d    3
e    4
dtype: int32

In [126]:
series3

a       10
b       20
c       30
d       40
e    hello
dtype: object

In [127]:
series1[0]

1

In [128]:
series1['a']

1

In [129]:
series1[0:2]

a    1
b    2
dtype: int64

In [130]:
series1['a':'c']

a    1
b    2
c    3
dtype: int64

In [131]:
series4

a       10
b       20
c       30
d       40
e    hello
f       60
dtype: object

In [132]:
type(series2)

pandas.core.series.Series

In [133]:
series3+series4

a            20
b            40
c            60
d            80
e    hellohello
f           NaN
dtype: object

In [134]:
series5 = series3+series4 #error because of different data type

In [135]:
series5

a            20
b            40
c            60
d            80
e    hellohello
f           NaN
dtype: object

In [136]:
#pandas creation

In [137]:
#creating pandas using list concept

list1 = [[1,2,3],[4,5,6],[7,8,9]]
list2 = ['a','b','c']
list3 = ['x','y','z']


pd.DataFrame(data= list1 , index=list2, columns=list3) #if not passing the index then default index will be taken

   x  y  z
a  1  2  3
b  4  5  6
c  7  8  9

In [138]:
#creating pandas using list concept

list1 = [[1,2,3],[4,5,6],[7,8,9]]
list2 = ['a','b','c']
list3 = ['x','y','z']


df= pd.DataFrame(data= list1 , index=list2, columns=list3) #if not passing the index then default index will be taken

In [139]:
df

   x  y  z
a  1  2  3
b  4  5  6
c  7  8  9

In [140]:
list4 = [1,2,3,4]
         
         
pd.DataFrame(data= list4)

   0
0  1
1  2
2  3
3  4

In [141]:
#creating date frame using dictionary

dict1 = {'name':['vishnu','vinay','jaya','ankit'], 'degree':['b.e','bca','mca','bsc'], 'city':['mysore', 'bang','chennai','nagpur'], }

In [142]:
df1= pd.DataFrame(data=dict1)   #data frame created using dictionary

In [143]:
df1

     name degree     city
0  vishnu    b.e   mysore
1   vinay    bca     bang
2    jaya    mca  chennai
3   ankit    bsc   nagpur

In [144]:
#third approach



from numpy.random import rand

df3=pd.DataFrame(data=rand(5,4))

In [145]:
#accessing data frame


df1.name

0    vishnu
1     vinay
2      jaya
3     ankit
Name: name, dtype: object

In [146]:
df1.degree

0    b.e
1    bca
2    mca
3    bsc
Name: degree, dtype: object

In [147]:
df1['name']  #square brackets

0    vishnu
1     vinay
2      jaya
3     ankit
Name: name, dtype: object

In [148]:
df1.name[0]

'vishnu'

In [149]:
#loc and iloc


df1

     name degree     city
0  vishnu    b.e   mysore
1   vinay    bca     bang
2    jaya    mca  chennai
3   ankit    bsc   nagpur

In [150]:
df1.loc['0':'3']

     name degree     city
0  vishnu    b.e   mysore
1   vinay    bca     bang
2    jaya    mca  chennai
3   ankit    bsc   nagpur

In [151]:
df1.loc['1':'3','name':'degree']

    name degree
1  vinay    bca
2   jaya    mca
3  ankit    bsc

In [152]:
df1.loc[[0,1],['name','city','degree']]

     name    city degree
0  vishnu  mysore    b.e
1   vinay    bang    bca

In [153]:
df1.loc['0':'5','name':'degree']

     name degree
0  vishnu    b.e
1   vinay    bca
2    jaya    mca
3   ankit    bsc

In [154]:
df1[['name','degree']]

     name degree
0  vishnu    b.e
1   vinay    bca
2    jaya    mca
3   ankit    bsc

In [155]:
df1.loc[:,'name':'degree']

     name degree
0  vishnu    b.e
1   vinay    bca
2    jaya    mca
3   ankit    bsc

In [156]:
df1.loc[:,0:2]  # it wont work because it is label based

TypeError: cannot do slice indexing on Index with these indexers [0] of type int

In [157]:
df3.loc[0:3]

          0         1         2         3
0  0.565466  0.680265  0.347382  0.490957
1  0.534188  0.940011  0.664485  0.754621
2  0.276769  0.544536  0.941791  0.504180
3  0.325463  0.429398  0.483944  0.627777

In [158]:
df1.iloc[:]

     name degree     city
0  vishnu    b.e   mysore
1   vinay    bca     bang
2    jaya    mca  chennai
3   ankit    bsc   nagpur

In [159]:
df1.iloc[:,0:2]

     name degree
0  vishnu    b.e
1   vinay    bca
2    jaya    mca
3   ankit    bsc

In [160]:
df1.iloc[:,-3:-1]

     name degree
0  vishnu    b.e
1   vinay    bca
2    jaya    mca
3   ankit    bsc

In [161]:
df1.iloc[:,:-1]

     name degree
0  vishnu    b.e
1   vinay    bca
2    jaya    mca
3   ankit    bsc

In [162]:
df1

     name degree     city
0  vishnu    b.e   mysore
1   vinay    bca     bang
2    jaya    mca  chennai
3   ankit    bsc   nagpur

In [163]:
df1.iloc[:-1,:-1]

     name degree
0  vishnu    b.e
1   vinay    bca
2    jaya    mca

In [182]:
dict5 = {'a':[10, 20, 50], 'b':[30, 69, 40], 'c':[np.nan, 50, 60]}

In [183]:
dict5

{'a': [10, 20, 50], 'b': [30, 69, 40], 'c': [nan, 50, 60]}

In [184]:
df6=pd.DataFrame(data=dict5, index=['x','y','z'])

In [185]:
df6

    a   b     c
x  10  30   NaN
y  20  69  50.0
z  50  40  60.0

In [186]:
df6.dropna()

    a   b     c
y  20  69  50.0
z  50  40  60.0

In [187]:
df6.dropna(axis=1)

    a   b
x  10  30
y  20  69
z  50  40

In [188]:
df6

    a   b     c
x  10  30   NaN
y  20  69  50.0
z  50  40  60.0

In [190]:
df6.dropna(axis=1, inplace=True)

In [191]:
df6

    a   b
x  10  30
y  20  69
z  50  40

In [192]:
df6.dropna(axis=0, inplace=True)

In [193]:
df6

    a   b
x  10  30
y  20  69
z  50  40

In [194]:
dict7 = {'a':[10, 20, np.nan], 'b':[30, 69, 40], 'c':[90, 50, 60]}

In [195]:
df8 = pd.DataFrame(data=dict7)

In [196]:
df8.fillna(100)

       a   b   c
0   10.0  30  90
1   20.0  69  50
2  100.0  40  60

In [197]:
df8

      a   b   c
0  10.0  30  90
1  20.0  69  50
2   NaN  40  60

In [199]:
df8.fillna(100, inplace=True)

In [200]:
df8

       a   b   c
0   10.0  30  90
1   20.0  69  50
2  100.0  40  60

In [202]:
df10 =pd.DataFrame(data=df8)

In [203]:
df10.fillna(df10.std())

       a   b   c
0   10.0  30  90
1   20.0  69  50
2  100.0  40  60

In [209]:
#group by


dict10 = {'bike' : ['yamaha','yamaha','bajaj','RE','RE'], 'speed':[100,120,15,120,80]}
dict10

{'bike': ['yamaha', 'yamaha', 'bajaj', 'RE', 'RE'],
 'speed': [100, 120, 15, 120, 80]}

In [211]:
new_df=pd.DataFrame(data=dict10, index=['a','b','c','d','e'])
new_df

     bike  speed
a  yamaha    100
b  yamaha    120
c   bajaj     15
d      RE    120
e      RE     80

In [214]:
new_df.groupby(by='bike')

In [215]:
new_df.groupby(by='speed')

In [216]:
new_df.groupby(by='bike').mean()

        speed
bike
RE        100
bajaj      15
yamaha    110

In [218]:
new_df.append(new_df)

     bike  speed
a  yamaha    100
b  yamaha    120
c   bajaj     15
d      RE    120
e      RE     80
a  yamaha    100
b  yamaha    120
c   bajaj     15
d      RE    120
e      RE     80

In [222]:
df

   x  y  z
a  1  2  3
b  4  5  6
c  7  8  9

In [223]:
df*df

    x   y   z
a   1   4   9
b  16  25  36
c  49  64  81